Revit 2027 API
BRepBuilderEdgeGeometry.Create(XYZ, XYZ) Method
 Constructs a BRepBuilderEdgeGeometry representing a straight line between the two given points.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static BRepBuilderEdgeGeometry Create(
	XYZ startPoint,
	XYZ endPoint
)
Public Shared Function Create (
	startPoint As XYZ,
	endPoint As XYZ
) As BRepBuilderEdgeGeometry
public:
static BRepBuilderEdgeGeometry^ Create(
	XYZ^ startPoint,
	XYZ^ endPoint
)
static member Create :
        startPoint : XYZ *
        endPoint : XYZ -> BRepBuilderEdgeGeometry
Parameters
startPoint XYZ
endPoint XYZ
Return Value
BRepBuilderEdgeGeometry
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentsInconsistentException |  The vectors startPoint and endPoint are coincident.
See Also
Reference
BRepBuilderEdgeGeometry Class
Create Overload
Autodesk.Revit.DB Namespace